Revit 2024 API
AlternateUnits Enumeration
 An enumerated type listing the locations where Alternate units may be displayed in dimensions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum AlternateUnits
Visual Basic
Public Enumeration AlternateUnits
Visual C++
public enum class AlternateUnits
Members
Member name | Description
None |  No alternative units.
Right |  Alternative units display to the right of the primary units.
Below |  Alternative units display below the primary units.
See Also
Autodesk.Revit.DB Namespace